# VendorIdAttribute Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VendorIdAttribute Constructor
VendorIdAttribute Class See Also
---
Constructs a new VendorIdAttribute.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public VendorIdAttribute(
	string vendorIdStr
)
```

Visual Basic
---
```text
Public Sub New ( _
	vendorIdStr As String _
)
```

Visual C++
---
```text
public:
VendorIdAttribute(
	String^ vendorIdStr
)
```

# ### Parameters
vendorIdStr
    Type: System..::..String
# See Also
VendorIdAttribute Class
Autodesk.Revit.DB.Macros Namespace